app/controllers/admin/paintings_controller.rb

  def index
    @admin_paintings = Painting.all
---
SELECT `paintings`.* FROM `paintings`

  def show
    @admin_painting = Painting.find(params[:id])
---
SELECT `paintings`.* FROM `paintings` WHERE `paintings`.`id` = 1 LIMIT 1

  def edit
    @admin_painting = Painting.find(params[:id])
---
SELECT `paintings`.* FROM `paintings` WHERE `paintings`.`id` = 1 LIMIT 1

  def create
    @admin_painting = Painting.new(params[:painting])

    respond_to do |format|
      if @admin_painting.save
---
INSERT INTO `paintings` (`created_at`, `image`, `name`, `remote_image_url`, `updated_at`) VALUES ('2013-01-13 14:48:56', NULL, NULL, NULL, '2013-01-13 14:48:56')

  def update
    @admin_painting = Painting.find(params[:id])

    respond_to do |format|
      if @admin_painting.update_attributes(params[:painting])
---
SELECT `paintings`.* FROM `paintings` WHERE `paintings`.`id` = 1 LIMIT 1
UPDATE `paintings` SET `name` = '3333', `image` = 'get2.jpeg', `updated_at` = '2013-01-13 15:12:06' WHERE `paintings`.`id` = 2