app/controllers/admin/songs_controller.rb

  def index
    @admin_songs = Admin::Song.all
---
SELECT `songs`.* FROM `songs`