app/controllers/admin/videos_controller.rb

SELECT `videos`.* FROM `videos`
---
  def index
    @admin_videos = Video.find :all

INSERT INTO `videos` (`created_at`, `description`, `source_content_type`, `source_file_name`, `source_file_size`, `title`, `updated_at`, `url`) VALUES ('2013-01-15 16:25:03', NULL, NULL, NULL, NULL, NULL, '2013-01-15 16:25:03', NULL)
---
  def create
    @admin_video = Video.new(params[:admin_video])
    if @admin_video.save