app/controllers/songs_controller.rb

SELECT `songs`.* FROM `songs`
---
  def index
    @songs = Song.all

SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = 1 LIMIT 1
---
  def show
    @song = Song.find(params[:id])

INSERT INTO `songs` (`album`, `created_at`, `name`, `path`, `publish_at`, `updated_at`) VALUES ('花蝴蝶', '2013-01-13 11:35:17', '飞舞', '', '2013-01-13', '2013-01-13 11:35:17')
---
  def create
    @song = Song.new(params[:song])

    respond_to do |format|
      if @song.save