app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1
---
  def show
    @video = Video.find(params[:id])